<?php

function greeklish($str){


  $expressions = array(

      '/[αάΑΆ]/u'   => 'a',
  '/[βΒ]/u'     => 'v',
  '/[γΓ]/u'     => 'g',
  '/[δΔ]/u'     => 'd',
  '/[εέΕΈ]/u'   => 'e',
  '/[ζΖ]/u'     => 'z',
  '/[ηήΗΉ]/u'   => 'i',
  '/[θΘ]/u'     => 'th',
  '/[ιίϊΙΊΪ]/u' => 'i',
  '/[κΚ]/u'     => 'k',
  '/[λΛ]/u'     => 'l',
  '/[μΜ]/u'     => 'm',
  '/[νΝ]/u'     => 'n',
  '/[ξΞ]/u'     => 'x',
  '/[οόΟΌ]/u'   => 'o',
  '/[πΠ]/u'     => 'p',
  '/[ρΡ]/u'     => 'r',
  '/[σςΣ]/u'    => 's',
  '/[τΤ]/u'     => 't',
  '/[υύϋΥΎΫ]/u' => 'y',
  '/[φΦ]/iu'    => 'f',
  '/[χΧ]/u'     => 'ch',
  '/[ψΨ]/u'     => 'ps',
  '/[ωώ]/iu'    => 'o',
  '/[αΑ][ιίΙΊ]/u'                             => 'e',
  '/[οΟΕε][ιίΙΊ]/u'                           => 'i',
  '/[αΑ][υύΥΎ]([θΘκΚξΞπΠσςΣτTφΡχΧψΨ]|\s|$)/u' => 'af$1',
  '/[αΑ][υύΥΎ]/u'                             => 'av',
  '/[εΕ][υύΥΎ]([θΘκΚξΞπΠσςΣτTφΡχΧψΨ]|\s|$)/u' => 'ef$1',
  '/[εΕ][υύΥΎ]/u'                             => 'ev',
  '/[οΟ][υύΥΎ]/u'                             => 'ou',
  '/(^|\s)[μΜ][πΠ]/u'                         => '$1b',
  '/[μΜ][πΠ](\s|$)/u'                         => 'b$1',
  '/[μΜ][πΠ]/u'                               => 'b',
  '/[νΝ][τΤ]/u'                               => 'nt',
  '/[τΤ][σΣ]/u'                               => 'ts',
  '/[τΤ][ζΖ]/u'                               => 'tz',
  '/[γΓ][γΓ]/u'                               => 'ng',
  '/[γΓ][κΚ]/u'                               => 'gk',
  '/[ηΗ][υΥ]([θΘκΚξΞπΠσςΣτTφΡχΧψΨ]|\s|$)/u'   => 'if$1',
  '/[ηΗ][υΥ]/u'                               => 'iu',

  );
  $str = preg_replace( array_keys($expressions), array_values($expressions), $str );

  //$str = strtr($str,  $cyr_table);
  $str = preg_replace("/[^A-Za-z0-9'_\-\.]/", '-', $str);
  $str = preg_replace('/\-+/', '-', $str);
  $str = preg_replace('/^-+/', '', $str);
  $str = preg_replace('/-+$/', '', $str);
  return $str;
}

function uppercase($str){
  $str = mb_strtolower($str);
  $str = str_replace(array('ά','έ','ή','ί','ό','ύ','ώ'), array('α','ε','η','ι','ο','υ','ω'), $str );
  return  mb_strtoupper($str);
}

 ?>
